verification/runs/F14-cooling-ladder/K2e_runs/m48_dT3_vd/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.orig";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    hotWall         { type fixedValue; value uniform 301.500000000; }
    coldWall        { type fixedValue; value uniform 298.500000000; }
    adiabaticWalls  { type zeroGradient; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
