verification/runs/F14-cooling-ladder/K2e_runs/m48_dT3_vd/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3000;
deltaT          1;
writeControl    timeStep;
writeInterval   3000;
purgeWrite      1;
writeFormat     ascii;
writePrecision  16;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable false;

functions
{
    gradT
    {
        type            grad;
        libs            (fieldFunctionObjects);
        field           T;
        result          k2eGradT;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    none;
        log             false;
    }
    hotFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            hotWall;
        operation       areaNormalIntegrate;
        fields          (k2eGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    coldFlux
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            coldWall;
        operation       areaNormalIntegrate;
        fields          (k2eGradT);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    hotT
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            hotWall;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    coldT
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            coldWall;
        operation       areaAverage;
        fields          (T);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    magU
    {
        type            mag;
        libs            (fieldFunctionObjects);
        field           U;
        result          k2eMagU;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    none;
        log             false;
    }
    Umax
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        regionType      all;
        operation       max;
        fields          (k2eMagU);
        writeFields     false;
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
    Tcentre
    {
        type            probes;
        libs            (fieldFunctionObjects);
        fields          (T);
        probeLocations  ((0.050000 0.050000 0.005000));
        writeToFile     true;
        log             true;
        executeControl  timeStep;
        executeInterval 50;
        writeControl    timeStep;
        writeInterval   50;
    }
}

// ************************************************************************* //
